app/controllers/songs_controller.rb

	def index
		@songs = Song.where(:user_id => current_user.id)
---
SELECT "songs".* FROM "songs" WHERE "songs"."user_id" = ?  [["user_id", 1]]