app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
	def index
		# render plain: "adsfasfdfasdfsdfsd"
		# @songs = Song.where(:user_id => current_user.id)
		# render '/songs_index'

		@songs=Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."artist" = ? AND "songs"."title" = ? LIMIT 1  [["artist", "Prince"], ["title", "Purple Rain"]]
SELECT  1 AS one FROM "songs" WHERE "songs"."title" = ? AND "songs"."artist" = ? LIMIT 1  [["title", ""], ["artist", ""]]
UPDATE "songs" SET "num_added" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["num_added", 3], ["updated_at", "2016-09-26 20:09:30.375109"], ["id", 1]]
INSERT INTO "songs" ("artist", "title", "user_id", "num_added", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["artist", "Prince"], ["title", "Some Other Song"], ["user_id", 1], ["num_added", 1], ["created_at", "2016-09-26 21:05:09.910725"], ["updated_at", "2016-09-26 21:05:09.910725"]]
---
	def create


		if Song.exists?(title: params[:title], artist: params[:artist])
			@song =Song.find_by_artist_and_title(params[:artist], params[:title])

			@song.increment!(:num_added, 1)
			@song.save
			@songs=Song.all

      		redirect_to root_path
		else

			@song = Song.new(song_params)
			@song.user_id = current_user.id
			@song.num_added = 1
			@songs=Song.all
			# render plain: @song.user_id
			if @song.save